espruino/Espruino/targets/nrf5x/bluetooth_ancs.c
  JsVar *o = jsvNewObject();
  if (!o) return;
  ble_date_time_t time = p_time->exact_time_256.day_date_time.date_time;
  CalendarDate date;
  date.year = time.year;
  date.month = time.month;
  date.day = time.day;
  TimeInDay td;
  td.daysSinceEpoch = fromCalenderDate(&date);
  td.hour = time.hours;
  td.min = time.minutes;
  td.sec = time.seconds;
  td.ms = (((int)p_time->exact_time_256.fractions256) * 1000) >> 8;
  td.zone = 0; // assume no timezone?
  jsvObjectSetChildAndUnLock(o, "date", jswrap_date_from_milliseconds(fromTimeInDay(&td)));

  int dow = p_time->exact_time_256.day_date_time.day_of_week;
  if (dow) {
    if (dow==7) dow=0; // sunday, match JS dates
    jsvObjectSetChildAndUnLock(o, "day", jsvNewFromInteger(dow));
  }
  JsVar *arr = jsvNewEmptyArray();
  if (p_time->adjust_reason.manual_time_update)
    jsvArrayPushAndUnLock(arr, jsvNewFromString("manual"));
  if (p_time->adjust_reason.external_reference_time_update)
    jsvArrayPushAndUnLock(arr, jsvNewFromString("external"));
  if (p_time->adjust_reason.change_of_time_zone)
    jsvArrayPushAndUnLock(arr, jsvNewFromString("timezone"));
  if (p_time->adjust_reason.change_of_daylight_savings_time)
    jsvArrayPushAndUnLock(arr, jsvNewFromString("DST"));
  jsvObjectSetChildAndUnLock(o, "reason", arr);

  jsiExecuteEventCallbackOn("E", JS_EVENT_PREFIX"CTS", 1, &o);
  jsvUnLock(o);
}

void ble_ancs_clear_app_attr() {
  memset(m_attr_appname      ,0, sizeof(m_attr_appname));
}

void ble_ancs_clear_attr() {
  memset(m_attr_appid        ,0, sizeof(m_attr_appid));
  memset(m_attr_title        ,0, sizeof(m_attr_title));
  memset(m_attr_subtitle     ,0, sizeof(m_attr_subtitle));
  memset(m_attr_message      ,0, sizeof(m_attr_message));
  memset(m_attr_message_size ,0, sizeof(m_attr_message_size));
  memset(m_attr_date         ,0, sizeof(m_attr_date));
  memset(m_attr_posaction    ,0, sizeof(m_attr_posaction));
  memset(m_attr_negaction    ,0, sizeof(m_attr_negaction));
  // memset(m_attr_disp_name    ,0, sizeof(m_attr_disp_name));
}

void ble_ancs_bonding_succeeded(uint16_t conn_handle) {
  NRF_LOG_INFO("ble_ancs_bonding_succeeded\n");
  uint32_t ret  = ble_db_discovery_start(&m_ble_db_discovery, conn_handle);
  APP_ERROR_CHECK_NOT_URGENT(ret);
}


/**@brief Function for setting up GATTC notifications from the Notification Provider.
 *
 * @details This function is called when a successful connection has been established.
 */
static void apple_notification_setup(void)
{
    ret_code_t ret;

    nrf_delay_ms(100); // Delay because we cannot add a CCCD to close to starting encryption. iOS specific.

    ret = ble_ancs_c_notif_source_notif_enable(&m_ancs_c);
    APP_ERROR_CHECK_NOT_URGENT(ret);

    ret = ble_ancs_c_data_source_notif_enable(&m_ancs_c);
    APP_ERROR_CHECK_NOT_URGENT(ret);

    m_ancs_active = true;
    NRF_LOG_DEBUG("Notifications Enabled.\n");

}

/**@brief Function for setting up GATTC notifications from the Notification Provider.
 *
 * @details This function is called when a successful connection has been established.
 */
static void apple_media_setup(void) {
  ret_code_t ret;

  nrf_delay_ms(100); // Delay because we cannot add a CCCD to close to starting encryption. iOS specific.

  ret = ble_ams_c_remote_command_notif_enable(&m_ams_c);
  APP_ERROR_CHECK_NOT_URGENT(ret);

  ret = ble_ams_c_entity_update_notif_enable(&m_ams_c);
  APP_ERROR_CHECK_NOT_URGENT(ret);

  m_ams_active = true;
  NRF_LOG_INFO("Apple Media-Notifications Enabled.\n");

  // Register for all EntityPlayer Attributes (Name, PlaybackInfo, Volume);
  uint8_t attribute_number = 3;
  uint8_t player_attribute_list[] = {BLE_AMS_PLAYER_ATTRIBUTE_ID_NAME,
                              BLE_AMS_PLAYER_ATTRIBUTE_ID_PLAYBACK_INFO,
                              BLE_AMS_PLAYER_ATTRIBUTE_ID_VOLUME};
  ret = ble_ams_c_entity_update_write(&m_ams_c, BLE_AMS_ENTITY_ID_PLAYER, attribute_number, player_attribute_list);

  // Register for all EntityTrack Attributes (TrackArtist, TrackAlbum, TrackTitle, TrackDuration);
  attribute_number = 4;
  uint8_t track_attribute_list[] = {BLE_AMS_TRACK_ATTRIBUTE_ID_ARTIST,
                              BLE_AMS_TRACK_ATTRIBUTE_ID_ALBUM,
                              BLE_AMS_TRACK_ATTRIBUTE_ID_TITLE,
                              BLE_AMS_TRACK_ATTRIBUTE_ID_DURATION};
  ret = ble_ams_c_entity_update_write(&m_ams_c, BLE_AMS_ENTITY_ID_TRACK, attribute_number, track_attribute_list);
  jsble_check_error(ret);
}



/**@brief Function for printing out errors that originated from the Notification Provider (iOS).
 *
 * @param[in] err_code_np Error code received from NP.
 */
static void err_code_print_ancs(uint16_t err_code_np)
{
  const char *errmsg = 0;
  switch (err_code_np)
  {
      case BLE_ANCS_NP_UNKNOWN_COMMAND:
        errmsg="Error: Command ID was not recognized by the Notification Provider.";
        break;
      case BLE_ANCS_NP_INVALID_COMMAND:
        errmsg="Error: Command failed to be parsed on the Notification Provider.";
        break;
      case BLE_ANCS_NP_INVALID_PARAMETER:
        errmsg="Error: Parameter does not refer to an existing object on the Notification Provider.";
        break;
      case BLE_ANCS_NP_ACTION_FAILED:
        errmsg="Error: Perform Notification Action Failed on the Notification Provider.";
        break;
      default:
        break;
  }
  if (errmsg) {
    NRF_LOG_INFO("Error: %s\n", errmsg);
  }
  if (BLETASK_IS_ANCS(bleGetCurrentTask()))
    bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), errmsg?jsvNewFromString(errmsg):0);
}


/**@brief Function for printing out errors that originated from the Media Source (iOS).
 *
 * @param[in] err_code_np Error code received from MS.
 */
static void err_code_print_ams(uint16_t err_code_ms)
{
  const char *errmsg = 0;
  switch (err_code_ms) {
  case BLE_AMS_MS_INVALID_STATE:
    errmsg="Error: Media Source is currently in an invalid state";
    break;

  case BLE_AMS_MS_INVALID_COMMAND:
    errmsg="Error: Command ID was not recognized by the Media Source";
    break;

  case BLE_AMS_MS_ABSENT_ATTRIBUTE:
    errmsg="Error: Attribute is absent on the Media Source";
    break;

  default:
    break;
  }
  if (errmsg) {
    NRF_LOG_INFO("Error: %s\n", errmsg);
  }

  if (BLETASK_IS_AMS(bleGetCurrentTask()))
      bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), errmsg?jsvNewFromString(errmsg):0);
}

/**@brief Function for handling the Apple Notification Service client.
 *
 * @details This function is called for all events in the Apple Notification client that
 *          are passed to the application.
 *
 * @param[in] p_evt  Event received from the Apple Notification Service client.
 */
static void on_ancs_c_evt(ble_ancs_c_evt_t * p_evt) {
  ret_code_t ret = NRF_SUCCESS;

