espruino/Espruino/targets/nrf5x/bluetooth_ancs.c
  NRF_LOG_DEBUG("ANCS%d\n", p_evt->evt_type);
  switch (p_evt->evt_type) {
    case BLE_ANCS_C_EVT_DISCOVERY_COMPLETE:
      NRF_LOG_DEBUG("Apple Notification Center Service discovered on the server.\n");
      ret = nrf_ble_ancs_c_handles_assign(&m_ancs_c, p_evt->conn_handle, &p_evt->service);
      APP_ERROR_CHECK_NOT_URGENT(ret);
      apple_notification_setup();
      break;

    case BLE_ANCS_C_EVT_NOTIF:
      NRF_LOG_DEBUG("EVT_NOTIF\n");
      // Push - creates an 'ANCS' event
      jsble_queue_pending_buf(BLEP_ANCS_NOTIF, 0, (char*)&p_evt->notif, sizeof(ble_ancs_c_evt_notif_t));
      break;

    case BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE:
      NRF_LOG_DEBUG("ATTR -> %d %d\n", p_evt->attr.attr_id, p_evt->notif_uid);
      m_notif_attr_latest = p_evt->attr;
      //jsble_queue_pending_buf(BLEP_ANCS_NOTIF_ATTR, 0, (char*)&p_evt->notif, sizeof(ble_ancs_c_evt_notif_t));
      //notif_attr_print(&m_notif_attr_latest);
      if(p_evt->attr.attr_id == BLE_ANCS_NOTIF_ATTR_ID_APP_IDENTIFIER)
      {
          m_notif_attr_app_id_latest = p_evt->attr;
      }
      // if done, push - creates an 'ANCSMSG' event
      if (p_evt->attr.attr_id == BLE_ANCS_NB_OF_NOTIF_ATTR-1) // TODO: better way to check for last attribute?
        jsble_queue_pending_buf(BLEP_ANCS_NOTIF_ATTR, 0, (char*)&m_notification_request, sizeof(ble_ancs_c_evt_notif_t));
      break;
    case BLE_ANCS_C_EVT_DISCOVERY_FAILED:
      NRF_LOG_DEBUG("Apple Notification Center Service not discovered on the server.\n");
      break;

    case BLE_ANCS_C_EVT_APP_ATTRIBUTE:
      NRF_LOG_DEBUG("ANCS app attr\n");
      // if done, push - creates an 'ANCSAPP' event
      jsble_queue_pending_buf(BLEP_ANCS_APP_ATTR, 0, (char*)p_evt->attr.p_attr_data, p_evt->attr.attr_len);
      break;
    case BLE_ANCS_C_EVT_NP_ERROR:
    case BLE_ANCS_C_EVT_INVALID_NOTIF:
      jsble_queue_pending(BLEP_ANCS_ERROR, 0);
      err_code_print_ancs(p_evt->err_code_np);
      break;
    default:
      // No implementation needed.
      break;
  }
}

/**@brief Function for handling the Apple Media Service client.
 *
 * @details This function is called for all events in the Apple Media Service client that
 *          are passed to the application.
 *
 * @param[in] p_evt  Event received from the Apple Media Service client.
 */
static void on_ams_c_evt(ble_ams_c_evt_t * p_evt) {
  ret_code_t ret = NRF_SUCCESS;

  NRF_LOG_DEBUG("AMS%d\n", p_evt->evt_type);
  switch (p_evt->evt_type) {
  case BLE_AMS_C_EVT_DISCOVERY_COMPLETE:
    NRF_LOG_INFO("Apple Media Service discovered on the server.\n");
    ret = nrf_ble_ams_c_handles_assign(&m_ams_c, p_evt->conn_handle,
        &p_evt->service);
    APP_ERROR_CHECK_NOT_URGENT(ret);
    apple_media_setup();
    break;

  case BLE_AMS_C_EVT_REMOTE_COMMAND_NOTIFICATION:
    NRF_LOG_INFO("BLE_AMS_C_EVT_REMOTE_COMMAND_NOTIFICATION: ListSize: %d.\n", p_evt->remote_command_data.remote_command_len);
    break;

  case BLE_AMS_C_EVT_ENTITY_UPDATE_NOTIFICATION:
    NRF_LOG_INFO("BLE_AMS_C_EVT_ENTITY_UPDATE_NOTIFICATION: entity %d, attr %d\n", p_evt->entity_update_data.entity_id, p_evt->entity_update_data.attribute_id);
    if (p_evt->entity_update_data.entity_id == BLE_AMS_ENTITY_ID_PLAYER) {
      jsble_queue_pending_buf(BLEP_AMS_PLAYER_UPDATE,
          p_evt->entity_update_data.attribute_id | (p_evt->entity_update_data.entity_update_flag?128:0),
          (char*)p_evt->entity_update_data.p_entity_update_data, p_evt->entity_update_data.entity_update_data_len);
    } else {
      jsble_queue_pending_buf(BLEP_AMS_TRACK_UPDATE,
          p_evt->entity_update_data.attribute_id | (p_evt->entity_update_data.entity_update_flag?128:0),
          (char*)p_evt->entity_update_data.p_entity_update_data, p_evt->entity_update_data.entity_update_data_len);
    }
    break;

  case BLE_AMS_C_EVT_ENTITY_ATTRIBUTE_READ_RESP: {
    NRF_LOG_INFO("BLE_AMS_C_EVT_ENTITY_ATTRIBUTE_READ_RESP\n");
    jsble_queue_pending_buf(BLEP_AMS_ATTRIBUTE,
            0,
            (char*)p_evt->entity_attribute_data.p_entity_attribute_data, p_evt->entity_attribute_data.attribute_len);
    /* TODO: deal with very long track names:
    if (p_evt->entity_attribute_data.attribute_len
        < (NRF_SDH_BLE_GATT_MAX_MTU_SIZE - 3)) {
      NRF_LOG_INFO("Read Complete!\n");
    } else {
      NRF_LOG_INFO(
          "Read not complete. Call sd_ble_gattc_read() with offset: %d\n",
          (p_evt->entity_attribute_data.attribute_offset
              + p_evt->entity_attribute_data.attribute_len));
      ble_ams_c_entity_attribute_read(&m_ams_c,
          (p_evt->entity_attribute_data.attribute_offset
              + p_evt->entity_attribute_data.attribute_len));
    }*/
    break;
  }

  case BLE_AMS_C_EVT_DISCOVERY_FAILED:
    NRF_LOG_INFO("Apple Media Service not discovered on the server.\n");
    break;

  case BLE_AMS_C_EVT_ENTITY_UPDATE_ATTRIBUTE_ERROR:
    err_code_print_ams(p_evt->err_code_ms);
    break;
  default:
    // No implementation needed.
    break;
  }
}

static void on_cts_c_evt(ble_cts_c_t * p_cts, ble_cts_c_evt_t * p_evt)
{
  ret_code_t err_code;
  switch (p_evt->evt_type) {
    case BLE_CTS_C_EVT_DISCOVERY_COMPLETE:
      NRF_LOG_INFO("CTS discovered on server.\n");
      err_code = ble_cts_c_handles_assign(&m_cts_c,
                                          p_evt->conn_handle,
                                          &p_evt->params.char_handles);
      APP_ERROR_CHECK_NOT_URGENT(err_code);
      m_cts_active = true;
      ble_cts_c_current_time_read(&m_cts_c); // now it's discovered, ask for time
      break;

    case BLE_CTS_C_EVT_DISCOVERY_FAILED:
      m_cts_active = false;
      NRF_LOG_INFO("CTS not found on server.\n");
      break;

    case BLE_CTS_C_EVT_DISCONN_COMPLETE:
      m_cts_active = false;
      NRF_LOG_INFO("Disconnect Complete.\n");
      break;

    case BLE_CTS_C_EVT_CURRENT_TIME:
      NRF_LOG_INFO("CTS Time received.\n");
      jsble_queue_pending_buf(BLEP_CTS_TIME,
          0,
          (char*)&p_evt->params.current_time, sizeof(p_evt->params.current_time));
      //current_time_print(p_evt);
      break;

    case BLE_CTS_C_EVT_INVALID_TIME:
      NRF_LOG_INFO("CTS Invalid Time received.\n");
      break;

    default:
      break;
  }
}

